<?php
// +----------------------------------------------------------------------
// | 海豚PHP框架 [ DolphinPHP ]
// +----------------------------------------------------------------------
// | 版权所有 2016~2017 河源市卓锐科技有限公司 [ http://www.zrthink.com ]
// +----------------------------------------------------------------------
// | 官方网站: http://dolphinphp.com
// +----------------------------------------------------------------------
// | 开源协议 ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------

/**
 * 插件配置信息
 */
return [
    ['text', 'ak', 'AccessKeyId', ''],
    ['text', 'sk', 'AccessKeySecret', ''],
    ['text', 'bucket', 'Bucket', '上传的空间名'],
    ['radio', 'cname', '是否绑定自定义域名', '如果选择“是”，则必须填写自定义域名', ['否', '是'], 0],
    ['text', 'domain', '自定义域名', '不用填写http://，直接填写域名'],
    ['text', 'endpoint', 'Endpoint', '如果没有绑定自定义域名，请填写阿里云OSS上的地域节点，如：<code>oss-cn-beijing.aliyuncs.com</code>'],
    ['text', 'dir', '存储目录', '留空则默认存储到主目录，可以自定义目录，如：<code>test/</code>，目录必须以“/”结尾'],
];
