<?php
// +----------------------------------------------------------------------
// | 海豚PHP框架 [ DolphinPHP ]
// +----------------------------------------------------------------------
// | 版权所有 2016~2017 河源市卓锐科技有限公司 [ http://www.zrthink.com ]
// +----------------------------------------------------------------------
// | 官方网站: http://dolphinphp.com
// +----------------------------------------------------------------------
// | 开源协议 ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------

/**
 * 模块信息
 */
/**
 * 模块信息
 */
return [
    // 模块名[必填]
    'name' => 'crontab',
    // 模块标题[必填]
    'title' => '任务模块',
    // 模块唯一标识[必填]，格式：模块名.开发者标识.module
    'identifier' => 'crontab.jshop.module',
    // 开发者[必填]
    'author' => 'Jason',
    // 版本[必填],格式采用三段式：主版本号.次版本号.修订版本号
    'version' => '1.0.0',
    // 模块描述[必填]
    'description' => '定时任务',
];
